; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v10 ?v2)
             (pred_8 ?v7 ?v6)
             (pred_6 ?v10 ?v6)
             (pred_2 ?v8 ?v10 )
	     (pred_12 ?v10)
             (pred_3 ?v9)
             (pred_7 ?v7)
             (pred_11 ?v6)
             (pred_9 ?v10)
             (pred_4 ?v7)
             (pred_10 ?v10)
             (pred_5 ))



(:action op_4
:parameters (?v1 ?v3 ?v11 ?v4)
:precondition (and (pred_3 ?v1) (pred_3 ?v3) (pred_7 ?v11) (pred_11 ?v4)
          (pred_1 ?v1 ?v3) (pred_8 ?v11 ?v4)
                   (pred_6 ?v3 ?v4) (pred_12 ?v1) 
                   (pred_9 ?v3) (pred_4 ?v11))
:effect (and  (pred_10 ?v3) (not (pred_9 ?v3))))


(:action op_2
:parameters (?v1 ?v13)
:precondition (and (pred_3 ?v1) (pred_3 ?v13)
               (pred_12 ?v1) (pred_1 ?v1 ?v13) (pred_10 ?v13))
:effect (and (pred_12 ?v13) (not (pred_12 ?v1))))

(:action op_1
:parameters (?v1 ?v11)
:precondition (and (pred_3 ?v1) (pred_7 ?v11) 
                  (pred_12 ?v1) (pred_2 ?v11 ?v1) (pred_5 ))
:effect (and (pred_4 ?v11)
   (not (pred_2 ?v11 ?v1)) (not (pred_5 ))))


(:action op_3
:parameters (?v1 ?v5 ?v12)
:precondition (and (pred_3 ?v1) (pred_7 ?v5) (pred_7 ?v12)
                  (pred_12 ?v1) (pred_4 ?v12) (pred_2 ?v5 ?v1))
:effect (and (pred_4 ?v5) (pred_2 ?v12 ?v1)
        (not (pred_4 ?v12)) (not (pred_2 ?v5 ?v1))))

(:action op_5
:parameters (?v1 ?v11)
:precondition (and (pred_3 ?v1) (pred_7 ?v11) 
                  (pred_12 ?v1) (pred_4 ?v11))
:effect (and (pred_5 ) (pred_2 ?v11 ?v1) (not (pred_4 ?v11)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_11 obj_05 obj_08 obj_02 obj_04 obj_03 obj_09 obj_06 obj_10
    obj_13 obj_07
    obj_01 obj_12
    )

    (:init
       (pred_5)

       (pred_3 obj_11)
       (pred_3 obj_05)
       (pred_3 obj_08)
       (pred_3 obj_02)
       (pred_3 obj_04)
       (pred_3 obj_03)
       (pred_3 obj_09)
       (pred_3 obj_06)
       (pred_3 obj_10)
       (pred_11 obj_13)
       (pred_11 obj_07)
       (pred_7 obj_01)
       (pred_7 obj_12)

       (pred_1 obj_11 obj_02)
       (pred_1 obj_11 obj_05)
       (pred_1 obj_05 obj_04)
       (pred_1 obj_05 obj_08)
       (pred_1 obj_05 obj_11)
       (pred_1 obj_08 obj_03)
       (pred_1 obj_08 obj_05)
       (pred_1 obj_02 obj_09)
       (pred_1 obj_02 obj_04)
       (pred_1 obj_02 obj_11)
       (pred_1 obj_04 obj_06)
       (pred_1 obj_04 obj_03)
       (pred_1 obj_04 obj_05)
       (pred_1 obj_04 obj_02)
       (pred_1 obj_03 obj_10)
       (pred_1 obj_03 obj_08)
       (pred_1 obj_03 obj_04)
       (pred_1 obj_09 obj_06)
       (pred_1 obj_09 obj_02)
       (pred_1 obj_06 obj_10)
       (pred_1 obj_06 obj_04)
       (pred_1 obj_06 obj_09)
       (pred_1 obj_10 obj_03)
       (pred_1 obj_10 obj_06)
       (pred_9 obj_08)
       (pred_9 obj_10)
       (pred_6  obj_08 obj_13)
       (pred_6  obj_10 obj_07)
       (pred_10 obj_11)
       (pred_10 obj_05)
       (pred_10 obj_02)
       (pred_10 obj_04)
       (pred_10 obj_03)
       (pred_10 obj_09)
       (pred_10 obj_06)

       (pred_8  obj_01 obj_13)
       (pred_8  obj_12 obj_07)
       (pred_2 obj_01 obj_06)
       (pred_2 obj_12 obj_11)
       (pred_12 obj_09)
    )

    (:goal (and
       (pred_2 obj_01 obj_05)
    ))
(:constraints
  (always (not (pred_12 obj_04)))
)
)

; plan
1. (op_2 obj_09 obj_06)
   deleted: (pred_12 obj_09)
   added: (pred_12 obj_06)
   goals met: 0 of 1
2. (op_1 obj_06 obj_01)
   deleted: (pred_2 obj_01 obj_06) (pred_5)
   added: (pred_4 obj_01)
   goals met: 0 of 1
3. (op_2 obj_06 obj_09)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_09)
   goals met: 0 of 1
4. (op_2 obj_09 obj_02)
   deleted: (pred_12 obj_09)
   added: (pred_12 obj_02)
   goals met: 0 of 1
5. (op_2 obj_02 obj_11)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_11)
   goals met: 0 of 1
6. (op_2 obj_11 obj_05)
   deleted: (pred_12 obj_11)
   added: (pred_12 obj_05)
   goals met: 0 of 1
7. (op_5 obj_05 obj_01)
   deleted: (pred_4 obj_01)
   added: (pred_5) (pred_2 obj_01 obj_05)
   goals met: 1 of 1
